{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"task8.ipynb","provenance":[],"authorship_tag":"ABX9TyPhBxx/dCWejfW9xqDMhxhJ"},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"aPSAbWw_tEwy"},"source":["# Задание 8"]},{"cell_type":"markdown","metadata":{"id":"uGTSP0cBtHdJ"},"source":["|Проверяемые элементы<br/> содержания и виды деятельности  | Уровень сложности<br/> задания |Максимальный<br/>балл |Примерное время<br> выполнения (мин.)\r\n","|:---- |:---:|:---:|:---:|\r\n","| Знания о методах измерения количества информации | Базовый | 1 | 4"]},{"cell_type":"markdown","metadata":{"id":"eI6E-ulNIo85"},"source":["## Задача 3\r\n","\r\n","Тимофей составляет  5 -буквенные коды из букв  Т ,  И ,  М ,  О ,  Ф ,  Е ,  Й . Буква  Т  должна входить в код ровно один раз.\r\n","\r\n","Сколько различных кодов может составить Тимофей?"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"IszZbyjkFYmo","executionInfo":{"status":"ok","timestamp":1615110665277,"user_tz":-180,"elapsed":830,"user":{"displayName":"Mike Antekov","photoUrl":"","userId":"18098464199046552064"}},"outputId":"dfd14436-0494-44fd-f0e1-a830c172123b"},"source":["s = 'ТИМОФЕЙ'\r\n","count = 0\r\n","for c1 in s:\r\n","  for c2 in s:\r\n","    for c3 in s:\r\n","      for c4 in s:\r\n","        for c5 in s:\r\n","          word = c1 + c2 + c3 + c4 + c5\r\n","          if word.count('Т') == 1:\r\n","            count += 1\r\n","count"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["6480"]},"metadata":{"tags":[]},"execution_count":4}]},{"cell_type":"markdown","metadata":{"id":"3T7vNtjZv5eg"},"source":["## Задача 6\r\n","\r\n","Тимофей составляет $5$-буквенные коды из букв $Т$, $И$, $М$, $О$, $Ф$, $Е$, $Й$. Буква $Т$\r\n","должна входить в код не менее одного раза, а буква $Й$ – не более одного раза.\r\n","\r\n","Сколько различных кодов может составить Тимофей?"]},{"cell_type":"markdown","metadata":{"id":"YQSD0I6awkg4"},"source":["В доступном наборе букв все буквы разные. Присвоим каждой букве номер из диапазона от $0$ до $6$ (всего $7$):\r\n","\r\n","| Т | И | М | О | Ф | Е | Й |\r\n","|---|---|---|---|---|---|---|\r\n","|0|1|2|3|4|5|6|7|\r\n","\r\n","Тогда любое слово из $5$ букв будет соответствовать списку пяти чисел из диапазона $[0; 6]$\r\n","\r\n","Сделаем пять вложенных циклов `for`, в переменных которых будут перебираться значения из диапазона $[0; 6]$:\r\n","\r\n","```python\r\n","for c1 in range(7):\r\n","  for c2 in range(7):\r\n","    ...\r\n","          for c5 in range(7):\r\n","            pass\r\n","```\r\n","\r\n","Внутри самого глубокого цикла сформируем список из переменных этих циклов:\r\n","```python\r\n","word = [c1,c2,c3,c4,c5]\r\n","```\r\n","\r\n","Остается только проверить, удовлетворяет ли полученное слово в виде списка чисел условию задачи. Если да, то увеличиваем счётчик. По условию в слове должна быть как минимум одна буква $Т$, то есть в списке количество чисел $0$ должно быть $\\geq 1$. Количество букв $Й$, то есть чисел $6$ в списке должно быть $\\leq 1$:\r\n","\r\n","```python\r\n","if word.count(0) >= 1 and word.count(6) <= 1:\r\n","  count += 1\r\n","```"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"zBdZbbccwfbg","executionInfo":{"status":"ok","timestamp":1615107488969,"user_tz":-180,"elapsed":1269,"user":{"displayName":"Mike Antekov","photoUrl":"","userId":"18098464199046552064"}},"outputId":"956ce8e2-52e2-478a-83b7-9366e479a28d"},"source":["count = 0\r\n","for c1 in range(7):\r\n","    for c2 in range(7):\r\n","        for c3 in range(7):\r\n","            for c4 in range(7):\r\n","                for c5 in range(7):\r\n","                    word = [c1,c2,c3,c4,c5]\r\n","                    if word.count(0) >= 1 and word.count(6) <= 1:\r\n","                        count += 1\r\n","print(count)\r\n"],"execution_count":null,"outputs":[{"output_type":"stream","text":["8006\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"bDxu5QmTtk2S"},"source":["## Задача 7\r\n","(А.Н. Носкин) Петя составляет шестибуквенные слова перестановкой букв слова $ЧИУАУА$. Сколько всего различных слов может составить Петя?"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"gZ0sWgWR6aqV","executionInfo":{"status":"ok","timestamp":1615107574968,"user_tz":-180,"elapsed":1198,"user":{"displayName":"Mike Antekov","photoUrl":"","userId":"18098464199046552064"}},"outputId":"b95879e7-cdea-4f04-c0f3-db59d04ac240"},"source":["s = set('ЧИУАУА')\r\n","s"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["{'А', 'И', 'У', 'Ч'}"]},"metadata":{"tags":[]},"execution_count":2}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"QX5VgjzBt17T","executionInfo":{"status":"ok","timestamp":1615020416979,"user_tz":-180,"elapsed":828,"user":{"displayName":"Mike Antekov","photoUrl":"","userId":"18098464199046552064"}},"outputId":"a753e0b7-752f-40f0-d179-7ac53cec1dc7"},"source":["s = set('ЧИУАУА')\r\n","\r\n","words = set()\r\n","\r\n","count = 0\r\n","for c1 in s:\r\n","    for c2 in s:\r\n","        for c3 in s:\r\n","            for c4 in s:\r\n","                for c5 in s:\r\n","                    for c6 in s:\r\n","                        word = c1+c2+c3+c4+c5+c6\r\n","                        if (word.count('Ч') == 1 and word.count('И') == 1 \r\n","                            and word.count('У') == 2 and word.count('А') == 2):\r\n","                                words.add(word)\r\n","print(len(words))"],"execution_count":null,"outputs":[{"output_type":"stream","text":["180\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"_DuTwPj9uC9O","executionInfo":{"status":"ok","timestamp":1615020824741,"user_tz":-180,"elapsed":833,"user":{"displayName":"Mike Antekov","photoUrl":"","userId":"18098464199046552064"}},"outputId":"b677998a-782d-4f40-97a3-7edb520f8a67"},"source":["s = list(set('ЧИУАУА'))\r\n","\r\n","n = len(s)\r\n","k = 6\r\n","words = set()\r\n","\r\n","for x in range(n**k):\r\n","  word = ''\r\n","  for i in range(k):\r\n","    word += s[x % n]\r\n","    x //= n\r\n","  if (word.count('Ч') == 1 and word.count('И') == 1 and\r\n","      word.count('У') == 2 and word.count('А') == 2):\r\n","    words.add(word)\r\n","    \r\n","print(len(words))"],"execution_count":null,"outputs":[{"output_type":"stream","text":["180\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"Gac2MMYGFQt6"},"source":[""]},{"cell_type":"code","metadata":{"id":"_M4uYelQHLGm"},"source":[""],"execution_count":null,"outputs":[]}]}