{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"task5.ipynb","provenance":[],"authorship_tag":"ABX9TyO6w67FwcPY0zFgRV5/tRg9"},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"Ct0hW3wIUDv-"},"source":["# Задание 5. Анализ и построение алгоритмов для исполнителей"]},{"cell_type":"markdown","metadata":{"id":"CVjIKsw1UOFy"},"source":["## Посимвольное двоичное преобразование"]},{"cell_type":"markdown","metadata":{"id":"e3SIrNuAUm-A"},"source":["**Задача 3**\n","\n","Алгоритм получает на вход натуральное число $N > 1$ и строит по нему новое\n","число $R$ следующим образом:\n","1. Строится двоичная запись числа N.\n","2. Вместо последней (самой правой) двоичной цифры дважды записывается\n","вторая слева цифра двоичной записи.\n","3. Результат переводится в десятичную систему.\n","\n","Пример. Дано число $N = 19$. Алгоритм работает следующим образом:\n","1. Двоичная запись числа $N$: $10011$.\n","2. Вторая слева цифра $0$, единица в конце записи заменяется на два нуля,\n","новая запись $100100$.\n","3. Результат работы алгоритма $R = 36$.\n","\n","При каком наименьшем числе $N$ в результате работы алгоритма получится\n","$R > 92$? В ответе запишите это число в десятичной системе счисления.\n","\n","> [Статград, 02-2021](../tests/)"]},{"cell_type":"code","metadata":{"id":"hi75VsLYTpCE","executionInfo":{"status":"ok","timestamp":1626513510456,"user_tz":-180,"elapsed":30,"user":{"displayName":"Mike Antekov","photoUrl":"","userId":"18098464199046552064"}},"outputId":"7e0be2dc-3e80-41bd-ba8d-3e2ca7081517","colab":{"base_uri":"https://localhost:8080/"}},"source":["def Algo(n):\n","    r = bin(n)[2:]\n","    d = r[1]\n","    r = r[:-1] + d + d\n","\n","    s = 0\n","    for i in range(len(r)):\n","        if r[i] == '1':\n","            s += 2 ** (len(r) - i - 1)\n","\n","    return s\n","\n","for n in range(2, 93):\n","    if Algo(n) > 92:\n","        print(n, Algo(n))"],"execution_count":1,"outputs":[{"output_type":"stream","text":["48 99\n","49 99\n","50 103\n","51 103\n","52 107\n","53 107\n","54 111\n","55 111\n","56 115\n","57 115\n","58 119\n","59 119\n","60 123\n","61 123\n","62 127\n","63 127\n","64 128\n","65 128\n","66 132\n","67 132\n","68 136\n","69 136\n","70 140\n","71 140\n","72 144\n","73 144\n","74 148\n","75 148\n","76 152\n","77 152\n","78 156\n","79 156\n","80 160\n","81 160\n","82 164\n","83 164\n","84 168\n","85 168\n","86 172\n","87 172\n","88 176\n","89 176\n","90 180\n","91 180\n","92 184\n"],"name":"stdout"}]}]}