{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"task5.ipynb","provenance":[],"authorship_tag":"ABX9TyMUnkY4QLRfjmPTfX4Tgfus"},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"Ct0hW3wIUDv-"},"source":["# Задание 5. Анализ и построение алгоритмов для исполнителей"]},{"cell_type":"markdown","metadata":{"id":"CVjIKsw1UOFy"},"source":["## Посимвольное двоичное преобразование"]},{"cell_type":"markdown","metadata":{"id":"e3SIrNuAUm-A"},"source":["**Задача 3**\r\n","\r\n","Алгоритм получает на вход натуральное число $N > 1$ и строит по нему новое\r\n","число $R$ следующим образом:\r\n","1. Строится двоичная запись числа N.\r\n","2. Вместо последней (самой правой) двоичной цифры дважды записывается\r\n","вторая слева цифра двоичной записи.\r\n","3. Результат переводится в десятичную систему.\r\n","\r\n","Пример. Дано число $N = 19$. Алгоритм работает следующим образом:\r\n","1. Двоичная запись числа $N$: $10011$.\r\n","2. Вторая слева цифра $0$, единица в конце записи заменяется на два нуля,\r\n","новая запись $100100$.\r\n","3. Результат работы алгоритма $R = 36$.\r\n","\r\n","При каком наименьшем числе $N$ в результате работы алгоритма получится\r\n","$R > 92$? В ответе запишите это число в десятичной системе счисления.\r\n","\r\n","> [Статград, 02-2021](../tests/)"]},{"cell_type":"code","metadata":{"id":"hi75VsLYTpCE"},"source":["def Algo(n):\r\n","    r = bin(n)[2:]\r\n","    d = r[1]\r\n","    r = r[:-1] + d + d\r\n","\r\n","    s = 0\r\n","    for i in range(len(r)):\r\n","        if r[i] == '1':\r\n","            s += 2 ** (len(r) - i - 1)\r\n","\r\n","    return s\r\n","\r\n","for n in range(2, 93):\r\n","    if Algo(n) > 92:\r\n","        print(n, Algo(n))"],"execution_count":null,"outputs":[]}]}