{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"task26.ipynb","provenance":[],"toc_visible":true,"authorship_tag":"ABX9TyMXA7Ekdp5TKOra1Wof2cMQ"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","metadata":{"id":"ETiSsJwnQ2Bf"},"source":["# Задание 26"]},{"cell_type":"markdown","metadata":{"id":"EXxGbinpQz4H"},"source":["## Задача 1\n","\n","В текстовом файле записан набор натуральных чисел, не превышающих $10^9$.\n","Гарантируется, что все числа различны. Необходимо определить, сколько\n","в наборе таких пар чётных чисел, что их среднее арифметическое тоже\n","присутствует в файле, и чему равно наибольшее из средних арифметических\n","таких пар.\n","\n","**Входные данные**\n","\n","Первая строка входного файла содержит целое число $N$ – общее количество\n","чисел в наборе. Каждая из следующих $N$ строк содержит одно число.\n","\n","**Пример входного файла**\n","```\n","6\n","3\n","8\n","14\n","11\n","2\n","17\n","```\n","В данном случае есть две подходящие пары: $8$ и $14$ (среднее арифметическое $11$),\n","$14$ и $2$ (среднее арифметическое $8$). В ответе надо записать числа $2$ и $11$.\n","\n","В ответе запишите два целых числа: сначала количество пар, затем\n","наибольшее среднее арифметическое."]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"E4lwApYMNw9X","executionInfo":{"status":"ok","timestamp":1617394708973,"user_tz":-180,"elapsed":1525,"user":{"displayName":"Mike Antekov","photoUrl":"","userId":"18098464199046552064"}},"outputId":"c14ad8d7-a798-4d8b-db35-465c319fb7b8"},"source":["%%time\n","f = open('task26/26-statgrad2.txt')\n","n = int(f.readline())\n","\n","# Все числа\n","numbers = [int(line) for line in f]\n","\n","# Чётные числа\n","even = [x for x in a if x % 2 == 0]\n","\n","# Обязательно преобразуем во множество - эффктивность поиска значения O(log n)\n","# вместо O(n) для списка\n","numbers = set(numbers)\n","\n","count = 0\n","max_s = 0\n","for i in range(len(even)):\n","    for j in range(i+1, len(even)):\n","        s = (even[i] + even[j]) // 2\n","        if s in numbers:\n","            count += 1\n","            if s > max_s:\n","                max_s = s\n","\n","print(count, max_s)"],"execution_count":null,"outputs":[{"output_type":"stream","text":["15 976339247\n","CPU times: user 834 ms, sys: 2.21 ms, total: 836 ms\n","Wall time: 837 ms\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"lTq2ml-JBt9-"},"source":["37)\t(А.М. Кабанов) На складе лежат пакеты с углём различного веса и стоимости. Вес и стоимость записаны на каждом пакете как натуральные числа: вес не превосходит 100, стоимость не превосходит 10000. Для транспортировки отбираются K пакетов с самой выгодной ценой угля за единицу веса. По заданной информации о пакетах с углём и количестве транспортируемых пакетов определите наибольший возможный вес отправленного угля и стоимость самого большого отправленного пакета.\n","\n","Входные данные представлены в файле следующим образом. В первой строке через пробел записаны числа N — количество пакетов на складе (натуральное число, не превышающее 1000) и K – количество пакетов на отправку (натуральное число, не превосходящее 100). В каждой из последующих N строк через пробел записаны два числа – вес и стоимость каждого пакета.\n","\n","Запишите в ответе два числа – сначала наибольший возможный вес отправленных пакетов, затем стоимость самого большого отправленного пакета.\n","\n","Пример организации исходных данных во входном файле:\n","```\n","10 4\n","47 470\n","50 600\n","60 480\n","45 540\n","30 300\n","15 180\n","70 560\n","30 360\n","91 910\n","40 320\n","```\n","При таких исходных данных самая выгодная стоимость у пакетов весом 60, 70, 40; затем – у пакетов весом 91, 30, 47. Поэтому наибольший возможный вес к отправке равен 70+60+40+91 = 261, а стоимость самого большого отправленного пакета равна 910.\n","\n"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"hn962xiACJrR","executionInfo":{"status":"ok","timestamp":1617963633963,"user_tz":-180,"elapsed":779,"user":{"displayName":"Mike Antekov","photoUrl":"","userId":"18098464199046552064"}},"outputId":"34fe8ec8-955f-4e9d-c1b3-ea811fdcdca1"},"source":["f = open('26-j6.txt')\n","n, k = map(int, f.readline().split())\n","packets = sorted([tuple(map(int, line.split())) for line in f], key=lambda p: (p[1]/p[0], -p[0]))\n","\n","send_packets = packets[:k]\n","\n","print(sum([p[0] for p in send_packets]), max(send_packets)[1])"],"execution_count":23,"outputs":[{"output_type":"stream","text":["5931 800\n"],"name":"stdout"}]}]}